docs/org/server.org
#+TITLE: Server Documentation
#+AUTHOR: Petros Papapanagiotou
#+EMAIL: petros@workflowfm.com
#+OPTIONS: toc:nil email:t 
#+EXCLUDE_TAGS: noexport
#+PROPERTY: header-args :results output drawer :session workflowfm :exports both :eval no-export :dir ../../
#+HUGO_AUTO_SET_LASTMOD: t

#+HUGO_BASE_DIR: ../
#+HUGO_SECTION: server
#+HUGO_TYPE: docs
#+HUGO_PAIRED_SHORTCODES: tip 
** Run
   :PROPERTIES:
   :EXPORT_FILE_NAME: run
   :EXPORT_HUGO_WEIGHT: 230
   :END:
*** Configuration

    Running the server requires a ~.properties~ configuration file with 3 elements:
    1. ~server~: The host name (default: ~localhost~).
    2. ~port~: The port to bind to for listening (default: ~7000~).
    3. ~launchProverCommand~: The location of the [[#script][script to run the reasoner]].

    The contents of the ~docker.properties~ file, which is used in the Docker image, is shown as an example below:
    #+begin_example
    server=localhost
    port=7000
    launchProverCommand=/server/scripts/launch_prover_docker.sh
    #+end_example

*** Launch

    To summarize, running the server requires the following:
    1. An installation of the Java server.
    2. A working installation of the reasoner.
    3. A configuration file.
    
    With everything in place, the server can be run from its installation with the following command:
    #+BEGIN_SRC sh
      ./bin/WorkflowFM_Server /path/to/configuration/file.properties
    #+END_SRC
